[{"categories":["Personal"],"content":"This past weekend, I had the incredible opportunity to participate in the Meta Llama Impact Hackathon in London, and what an intense experience it turned out to be! The event brought together some of the most passionate developers and innovators I’ve seen in quite a while, with participants flying in from as far as Switzerland and the USA. The stakes were high, with substantial prizes on the line, and you could feel the energy in the room. ","date":"2024-11-17","objectID":"/2024/11/llama_impact_hackathon/:0:0","tags":null,"title":"Llama Impact Hackathon","uri":"/2024/11/llama_impact_hackathon/"},{"categories":["Personal"],"content":"Our Ambitious Project My team, consisting of Victor, Chris, and myself, set out to tackle a challenge in the healthcare space. Our vision was to create an Electron-based application that would improve doctor-patient interactions. The core idea was elegant in its simplicity: create a system that would listen to doctor-patient conversations in real-time, transcribe them, and automatically generate comprehensive medical notes. But we didn’t stop there. We also wanted to implement an intelligent question suggestion system that would dynamically update based on the conversation flow, ensuring doctors wouldn’t miss any crucial points during their consultations. Looking back, I can see how this could be valuable beyond just medical consultations - any professional conversation could benefit from such a system. ","date":"2024-11-17","objectID":"/2024/11/llama_impact_hackathon/:1:0","tags":null,"title":"Llama Impact Hackathon","uri":"/2024/11/llama_impact_hackathon/"},{"categories":["Personal"],"content":"Technical Challenges and Lessons Learned Our tech stack was ambitious: an Electron frontend paired with a Python backend, utilizing Llama 3.2 for text processing and OpenAI’s Whisper for speech-to-text conversion. The challenge wasn’t just in implementing these technologies individually, but in making them work together seamlessly in real-time. One of our biggest learning moments came from our approach to integration. We spent too much time developing the frontend and backend independently, leaving the crucial integration phase until around midnight. In retrospect, this was our first major lesson: start with integration. It’s better to have a fully connected system early, even if it’s basic, than to have two sophisticated but separate pieces that you’re trying to join at the last minute. The real technical challenge emerged around 4 AM (yes, we pulled an all-nighter!) when we were wrestling with the efficient decoding of live-streamed audio data while trying to perform inference on various models. Sadly getting this to work in a timely manner while maintaining accuracy was no small feat, and we missed the mark on delivering the full working prototype. ","date":"2024-11-17","objectID":"/2024/11/llama_impact_hackathon/:2:0","tags":null,"title":"Llama Impact Hackathon","uri":"/2024/11/llama_impact_hackathon/"},{"categories":["Personal"],"content":"The All-Nighter Debate Speaking of all-nighters - let me share some wisdom earned the hard way: staying overnight at the venue isn’t worth it, no matter how tempting the prize money might be. While we managed to push through until 9 AM, I’ve made a mental note for future hackathons: no code written after 2 AM is worth the sacrifice of clear thinking the next day. Though I must admit, there’s something special about those late-night coding sessions, even if they’re not the most productive. ","date":"2024-11-17","objectID":"/2024/11/llama_impact_hackathon/:3:0","tags":null,"title":"Llama Impact Hackathon","uri":"/2024/11/llama_impact_hackathon/"},{"categories":["Personal"],"content":"Reflections and Looking Forward While we didn’t win the competition, the experience was invaluable. Working with Victor and Chris was fantastic - their technical skills and determination were great! I’m already looking forward to participating in more coding competitions, not just for the chance to win, but to maintain and sharpen my technical skills. There’s nothing quite like a hackathon to push you out of your comfort zone and force you to learn new things under pressure. ","date":"2024-11-17","objectID":"/2024/11/llama_impact_hackathon/:4:0","tags":null,"title":"Llama Impact Hackathon","uri":"/2024/11/llama_impact_hackathon/"},{"categories":["Personal"],"content":"Key Takeaways Start with integration early - don’t leave it as an afterthought Set realistic scope for your project timeline All-nighters might seem heroic, but they rarely lead to better outcomes Sometimes the greatest value isn’t in winning, but in the problem-solving journey Working with passionate teammates makes even the most challenging projects enjoyable As I look back on this weekend, I’m reminded that success in hackathons isn’t just about the end result - it’s about the learning experience, the connections made, and the joy of building something new. The Llama Impact Hackathon may be over, but the lessons learned and the enthusiasm it sparked will carry forward into my future projects. Next time you’re considering joining a hackathon - do it. Just remember to get some sleep! Here is the github link -\u003e https://github.com/fredericowieser/LlamaImpactHackathon2024 ","date":"2024-11-17","objectID":"/2024/11/llama_impact_hackathon/:5:0","tags":null,"title":"Llama Impact Hackathon","uri":"/2024/11/llama_impact_hackathon/"},{"categories":["Technical"],"content":"Hugo is a static site generator for creating fast and fairly complex websites, written in Go. When using you do not have to be familiar with Go and it is even possible to only have to write Markdown files when making your own website. When I have used it though I have found it very useful to know some HTML/CSS and Javascript, these tools allow you to customise your website much more and have helped me to tailor the websites I’ve made in the past to have great features such as tools to pull information from other sites to then be displayed or even to implement your own commenting system. The use cases are pretty wide. I myself have made Hugo powered websites for the technical documentation of a few teams at one of my previous roles and have also now used it to write the website you are most likely reading this on at https://fredericowieser.github.io/. ","date":"2024-07-25","objectID":"/2024/07/make_a_hugo_site/:0:0","tags":null,"title":"Making A Hugo Website","uri":"/2024/07/make_a_hugo_site/"},{"categories":["Technical"],"content":"How to get started? I would recommend going to the Quick start | Hugo guide. After that direct yourself to the Complete List | Hugo Themes where you can pick out a base template to then customise and work on, I have found this to be the fastest way to achieving a Minimal Viable Product. All the themes will have git repositories available for you to then build on locally. ","date":"2024-07-25","objectID":"/2024/07/make_a_hugo_site/:1:0","tags":null,"title":"Making A Hugo Website","uri":"/2024/07/make_a_hugo_site/"},{"categories":["Technical"],"content":"Examples Of What Can Be Done In This Blog This blog post uses Markdown, and I’ll demonstrate some of the cool things you can include! ","date":"2024-07-25","objectID":"/2024/07/make_a_hugo_site/:2:0","tags":null,"title":"Making A Hugo Website","uri":"/2024/07/make_a_hugo_site/"},{"categories":["Technical"],"content":"Code Examples You can easily include code snippets in your Hugo posts. Here’s an example of a simple HTML structure: \u003c!DOCTYPE html\u003e \u003chtml lang=\"en\"\u003e \u003chead\u003e \u003cmeta charset=\"UTF-8\"\u003e \u003cmeta name=\"viewport\" content=\"width=device-width, initial-scale=1.0\"\u003e \u003ctitle\u003eMy Hugo Website\u003c/title\u003e \u003c/head\u003e \u003cbody\u003e \u003ch1\u003eHello from Hugo!\u003c/h1\u003e \u003cp\u003eThis is a simple paragraph.\u003c/p\u003e \u003c/body\u003e \u003c/html\u003e And here’s a little bit of CSS to style it: body { font-family: sans-serif; line-height: 1.6; margin: 20px; } h1 { color: #333; } You can also show more complex code, like a Go function: package main import \"fmt\" func main() { fmt.Println(\"This is a Go program!\") } ","date":"2024-07-25","objectID":"/2024/07/make_a_hugo_site/:2:1","tags":null,"title":"Making A Hugo Website","uri":"/2024/07/make_a_hugo_site/"},{"categories":["Technical"],"content":"LaTeX for Mathematical Expressions If you need to include mathematical equations, you can use LaTeX syntax. Here’s an inline example: The famous equation $E=mc^2$ relates energy and mass. And here’s a display math example: $$ \\int_{-\\infty}^{\\infty} e^{-x^2} dx = \\sqrt{\\pi} $$ Another example, the quadratic formula: $$ x = \\frac{-b \\pm \\sqrt{b^2 - 4ac}}{2a} $$ And even: \\begin{CD} A @\u003ea\u003e\u003e B \\\\ @VbVV @AAcA \\\\ C @= D \\end{CD} ","date":"2024-07-25","objectID":"/2024/07/make_a_hugo_site/:2:2","tags":null,"title":"Making A Hugo Website","uri":"/2024/07/make_a_hugo_site/"},{"categories":["Technical"],"content":"More… To read more about this checkout the documentation website for this theme I am basing my website on… https://hugoloveit.com/theme-documentation-built-in-shortcodes/ https://hugoloveit.com/theme-documentation-extended-shortcodes/ https://hugoloveit.com/basic-markdown-syntax/ ","date":"2024-07-25","objectID":"/2024/07/make_a_hugo_site/:2:3","tags":null,"title":"Making A Hugo Website","uri":"/2024/07/make_a_hugo_site/"},{"categories":null,"content":"I am currently finishing my MSc in Computational Statistics and Machine Learning at UCL. Prior to this, I obtained a BSc in Theoretical Physics at UCL, during which I started to get more interested in Computers than Physics 🤦. After my BSc, I worked for 3 years doing professional software engineering for both a startup laser technology company, and an event-driven trading systems company for sports betting. I am currently completing my Master’s thesis under the guidance of Prof. Jun Wang and Dr. Zafeirios Fountas as part of being a Research Intern at Huawei’s Reinforcement Learning Lab (Noah’s Ark). Outside of work, I also enjoy coding, F1, board games, and art. If you’re interested in connecting contact me below. I am always open to discussing new projects, ideas, or collaborations. 📝 Curriculum Vitae Open PDF 📧 E-Mails: General: frederico.wieser@proton.me Academic: zcapfwi@ucl.ac.uk 👥 Social Links: 🐱 Github 💼 Linkedin 🤗 Hugging Face 🐦 Twitter 📺 Youtube ","date":"0001-01-01","objectID":"/about/:0:0","tags":null,"title":"About","uri":"/about/"}]